In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
x= [30,20,40,50]
df1 = pd.DataFrame(x,columns=['a'])
df1

    a
0  30
1  20
2  40
3  50

In [4]:
y = [[10,20,30],[90,78,67],['C#','Java','Python'],[True,False,True]]
y

[[10, 20, 30], [90, 78, 67], ['C#', 'Java', 'Python'], [True, False, True]]

In [5]:
df2 = pd.DataFrame(y,columns=['a','b','c'])
df2

      a      b       c
0    10     20      30
1    90     78      67
2    C#   Java  Python
3  True  False    True

In [6]:
dict = {
    'Name':['Raju','Kavitha','Kavya'],
    'Age' : [23,22,20],
    'Course':['C#','Android','Python']
}
print(dict)

{'Name': ['Raju', 'Kavitha', 'Kavya'], 'Age': [23, 22, 20], 'Course': ['C#', 'Android', 'Python']}

In [7]:
df3 = pd.DataFrame(dict,index=['i1','i2','i3'])
df3

       Name  Age   Course
i1     Raju   23       C#
i2  Kavitha   22  Android
i3    Kavya   20   Python

In [8]:
df3['Name']  # to get single column data

i1       Raju
i2    Kavitha
i3      Kavya
Name: Name, dtype: object

In [9]:
df3[['Name','Age']]   # to get mutiple column data

       Name  Age
i1     Raju   23
i2  Kavitha   22
i3    Kavya   20